In [2]:
import pandas as pd

# Descriptive Statistics in Pandas

In [5]:
data = pd.read_csv('data/wage.csv',index_col='year')
data.head()

      age        wage
year
2006   18   75.043154
2004   24   70.476020
2003   45  130.982177
2003   43  154.685293
2005   50   75.043154

## Sum

In [6]:
data.sum()

age      839.000000
wage    2333.253017
dtype: float64

In [7]:
data.sum().to_frame()

                0
age    839.000000
wage  2333.253017

In [8]:
data.sum(axis = 1)

year
2006     93.043154
2004     94.476020
2003    175.982177
2003    197.685293
2005    125.043154
2008    181.115744
2009    213.528538
2008    141.720849
2006    159.884359
2004    180.680488
2007    162.146817
2007    115.283253
2005    124.492480
2003    173.705375
2009    188.705375
2009    141.481913
2003    119.679637
2006    262.842352
2007    185.156693
2003    135.599344
dtype: float64

## Min & Max

In [9]:
data.min()

age     18.00000
wage    70.47602
dtype: float64

In [11]:
data.max()

age      56.000000
wage    212.842352
dtype: float64

In [12]:
data.idxmax() #will return index of maximum value

age     2007
wage    2006
dtype: int64

In [14]:
data.idxmin() #will return index of minimum value

age     2006
wage    2004
dtype: int64

## Describe

In [15]:
data.describe()

             age        wage
count  20.000000   20.000000
mean   41.950000  116.662651
std    10.343953   35.939001
min    18.000000   70.476020
25%    36.500000   87.789269
50%    43.500000  118.015588
75%    50.250000  131.912977
max    56.000000  212.842352

# Normalization

In [17]:
norm_data = (data - data.mean())/(data.max() - data.min())
norm_data.head()

           age      wage
year
2006 -0.630263 -0.292341
2004 -0.472368 -0.324421
2003  0.080263  0.100582
2003  0.027632  0.267076
2005  0.211842 -0.292341